PID/logs/2854201475_1_RequestGuichet.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion">
  <soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-tokenprofile-1.0#X509v3" wsu:Id="X509-649D8BECAA49443FBA4E92D605E4A323">MIIGqjCCBJKgAwIBAgIIVVH8QaoVhQYwDQYJKoZIhvcNAQELBQAwPTEWMBQGA1UE
AwwNQWVTLUktQ0EtVGVzdDEWMBQGA1UECgwNQWdlbmNlIGVTYW50ZTELMAkGA1UE
BhMCTFUwHhcNMjMxMTAyMTI0MjM5WhcNMjUxMTAxMTI0MjM4WjCBjDEjMCEGCSqG
SIb3DQEJARYUY2VydGlmaWNhdEBlc2FudGUubHUxEzARBgNVBAMMClRFU1QgTUlQ
SVQxEzARBgNVBAUTCjI4NTQyMDE0NzUxDTALBgNVBCoMBFRFU1QxDjAMBgNVBAQM
BU1JUElUMQ8wDQYDVQQMDAZQUy0wMDExCzAJBgNVBAYTAkxVMIICIjANBgkqhkiG
9w0BAQEFAAOCAg8AMIICCgKCAgEAtLqgrFDKKDfKaxJzxF0PQO2yxpAHuQ/bNIuW
3Jr23YWlZgvEqXl2031JDAt1Pr4sTr2vSRMy8PPjytY4VUffD9ahIRDf/F/m2Sit
9ggE+6+J3E36naDsGGYmU7Mre0BEKIA5Ew6LQvpFKvW9Jx7CQxw6jfxGlr3JXpx9
pJxlPohmgTvXIc6//Pffiu6LTEuKiK3fKYCpU1ZKIiOrX+IhhLjQf9NxKd7IQOnr
WQTSvvrUJGAm3dYtAg/s/dKNNYwEb/gS6cGs4Glh0b8DH82ZfgEQRk3wj4C+m+mM
sh0KDRb41Lwj+hJ4CY9xqrcXBpt+MOFvBW1lrHKVW6Ss7U+VUqS36IzhmpurJ0jj
WeyR2BKjJaDte4kN6uwdhjXQDRCMLTnEHKpL6xLki74G1n0ZiIDIjgw72SBpKjL/
qs0M6bR9uWKK6iXWiy1Iaj/5lNmmV840uKxbLqARgx/2MKvXsCsaUUq30gMHJzQM
Vb0ftb4ayZmox3PO8BATdovofmBYP66W5SDnCJhA9eLghKjaxSBKayNmbIxz+Pwl
bR7+k3afN9ZuqacWuJP5gsEft0yQRB9YgyB9gamkmmsI/T9MNwm54+JAx2C2CYoZ
6svkbZ3Op456oV+W/Fl4q9OqyMCMrs7etpwIDuec27npcZpn5htClNrE6cV7WX2g
Yx/2uRMCAwEAAaOCAVwwggFYMB8GA1UdIwQYMBaAFHzNGwGIayHofP6XJ94Tk9m0
PHpCMH0GCCsGAQUFBwEBBHEwbzA5BggrBgEFBQcwAoYtaHR0cDovL3BraS1pbnRl
Z3JhdGlvbi5lc2FudGUubHUvQWVTLUktQ0EuY3J0MDIGCCsGAQUFBzABhiZodHRw
Oi8vcGtpLWludGVncmF0aW9uLmVzYW50ZS5sdS9PQ1NQLzBHBgNVHSAEQDA+MDwG
BFUdIAAwNDAyBggrBgEFBQcCARYmaHR0cHM6Ly93d3ctaW50ZWdyYXRpb24uZXNh
bnRlLmx1L0NQUy8wPgYDVR0fBDcwNTAzoDGgL4YtaHR0cDovL3BraS1pbnRlZ3Jh
dGlvbi5lc2FudGUubHUvQWVTLUktQ0EuY3JsMB0GA1UdDgQWBBT5RObXWvJuDPOm
khZJyFFVdhrD/jAOBgNVHQ8BAf8EBAMCBeAwDQYJKoZIhvcNAQELBQADggIBAAvA
W/8Xn5tWZQ1Czjr+kzu+yxc3nhF9uLE9wZH4whj+ojeS6uuJQzPX4frRrrlde/k/
+7jeIQ7e4RP3t+5/qus7D6lHchu/Enufl2Cb5SsZRFAUbWYuwQiTl27onMws8TpZ
Cy1HfUowdlJRI9FaLw7Uleb6PfLtkv6qtP6jk7Z4ul0HUc1iLWoTlpfSSCEfNrjt
LvHZ22aTxOvEgxID7pEx6qjrg6SimCMRHCv+h2hy1xvZ679y/ax8t7eFpxfaiqYy
lsPO/WoNKRfMqYe5XVu4jM3YWpiDNoHIZXaYfZgtHiLX+8KL0LLkJNL0ukqZjFDt
+xLXOqAwPxkBOGL+p6PqkWlmQARACz5TFLLP0KlMnzgGeevlMJ9ytt74xxHimV1Y
xruK/bIxDqMASxVDTHxM0JG/XNPUBBr9JaT3MlGpKsXB5s2DWTQHjfmkW/MpcCMj
L+VzlQwrziOnUsyvSqXmIYnqTUrGA8bM+w/PwNuIk8ZiwRfMEPII8OAika5FXDrV
Gl1d3lkRrogz8lVXo+bQeztqyQMwkVYCQFYW9O9479AyvcLE2IuuirrSWnyKPD8C
nnCeV/2oTCmLm75lUTdUuwtg2J5Z5F426y6+jsWg9IZej9Kxe8wgSTcSMuiibfNs
zMl7eFZYcwhkyAksFh2pGgmuH8nfeoDoSjo++XTQ</wsse:BinarySecurityToken>
      <ds:Signature Id="SIG-8A64C6552EAFBF716616951123186246" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <ec:InclusiveNamespaces PrefixList="saml2 soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
          <ds:Reference URI="#TS-FD76A2DF0DDA49EB87ED272AC9211739">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces PrefixList="wsse saml2 soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
            <ds:DigestValue>rasi+a+IyD+Ctjh/0gIlfBelYnEQKS+izO8xLj1tC7g=</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#X509-649D8BECAA49443FBA4E92D605E4A323">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces PrefixList="" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
            <ds:DigestValue>bfRWOZyGwcFecsqUOrTk73traSlTDjuLGYJk1X51Wu8=</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#id-8063AF2F0B1A408CB0DE9AE9D026D783">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces PrefixList="saml2" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
            <ds:DigestValue>a8a25qcKEK6QiHo2JmEnv6iickHvPm4kCyulycnjpws=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>YiXT67gVKvYOdHe7enBNC3a4LNOKf7Y1yhZC/wL1JNExMGG9ggq1/1o+fIzl8mAFfrTYjl7Ot4ae5IjMWPZONxLowWBENO4NfGbRCsW+N4GNoL8snLCRoFfQMlLFFU+5n7TCx3hi8wCvSY60LOajK5svBLqLjlUJB0abt87+L6UAGgAfrRVfDdS68ZrM8zqCgW2hOSGiG7Xp9/SK5RDXFSOOxPtOfpwOTebg8UQMe+d18OfqDnJMVZ2shxqTJDC695/rKasinwcnrvbJtL8vN1Cedv4CcznghcEZ2mRe+sT0m9QzAtQIRfrjomVo1xWzR9Y2V75Qbv9NIBiuyLhTJjNZ8mPBEwavOhBsJ7pv2w5c8tsHSiGmtXSa6gJuQcQ8Adb6iA129kF28pXD8Iy1PRv2BRF6C1oRfH/pjxruxBGZRjs109Cwdn2MBdwjP0a3LNC6ceogYt+XqOg6of1fz9uKvj2tJsP3YfAy4T7luqlbh90U7wThcdtaB4VOiUSN+KcsKwZ34jyUO5o76nRuepz4nB6ixArxSutsXu5ecvFBAjew4w31agDG9R/NgH3btbgOHRjwdSVPuj027s9NROK3qcNNYZEm74HTAv6nazxM/tYRvVBCHjIs0UIrmlTOb69zl8/HX9cAo73eqxplAqvJsnJNPIhRVqrELRpFews=</ds:SignatureValue>
        <ds:KeyInfo Id="KI-8A64C6552EAFBF716616951123186033">
          <wsse:SecurityTokenReference wsu:Id="STR-8A64C6552EAFBF716616951123186054">
            <wsse:Reference URI="#X509-649D8BECAA49443FBA4E92D605E4A323" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
      <wsu:Timestamp wsu:Id="TS-FD76A2DF0DDA49EB87ED272AC9211739">
        <wsu:Created>2024-01-31T12:28:39.396Z</wsu:Created>
        <wsu:Expires>2024-01-31T12:38:39.396Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body wsu:Id="id-8063AF2F0B1A408CB0DE9AE9D026D783" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <saml2p:AuthnRequest AssertionConsumerServiceURL="https://ws.mysecu.lu:7443" Destination="https://www-integration.esante.lu/auth/realms/organization/ideosso/protocol/saml" ID="saml-D86473A5B01C4B26B925374B0FE05467" IssueInstant="2024-01-31T12:28:39" ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:SOAP" Version="2.0" xmlns:saml2p="urn:oasis:names:tc:SAML:2.0:protocol">
      <saml2:Issuer>https://ws.mysecu.lu:7443</saml2:Issuer>
      <saml2p:Extensions>
        <saml2:Attribute Name="psEHealthID" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified">
          <saml2:AttributeValue>2854201475</saml2:AttributeValue>
        </saml2:Attribute>
      </saml2p:Extensions>
      <saml2:Subject>
        <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/>
      </saml2:Subject>
      <saml2p:RequestedAuthnContext Comparison="minimum">
        <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
      </saml2p:RequestedAuthnContext>
    </saml2p:AuthnRequest>
  </soapenv:Body>
</soapenv:Envelope>
