src/tests/data/authnrequest.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:saml2p="urn:oasis:names:tc:SAML:2.0:protocol"><S:Body><saml2p:AuthnRequest AssertionConsumerServiceURL="https://signin.aws.amazon.com/saml" ID="_37435E75D88945F3A8ECFD538C1F6BCC" IssueInstant="2018-04-05T16:06:50Z" ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:PAOS" Version="2.0"><saml2:Issuer>urn:amazon:webservices</saml2:Issuer></saml2p:AuthnRequest></S:Body></S:Envelope>